#include "liquid.h"

int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	srand(time(NULL));
	int a = 0;
	const int colvo_str = 3;

	string name;
	char type;
	short tem;
	unsigned sp;



	cout << "Что делаем?\n1-сами ввести\t3-рандомную таблицу\n";
	cin >> a;
	liquid A[S];
	switch (a) {

	case 1:
		cout << "name, type, temperature, speed\n";
		for (int i = 0; i < S; i++)
		{
			cout << "---------------------\n";
			cin >> name;
			cin >> type;
			cin >> tem;
			cin >> sp;
			A[i].setter(name, type, tem, sp);
		}
		break;

	case 2:
		for (int i = 0; i < S; i++)
		{
			A[i].random();
		}

		cout << "Что дальше?" << endl;
		cout << "3-сортировка\t4-печать" << endl;
		cin >> a;
		if (a == 3) {
			cout << "Не отсортированная структура:" << endl;
			printf("-----------------------------------------------\n");
			printf("|          Скорость звука в жидкостях         |\n");
			printf("|---------------------------------------------|\n");
			printf("| Вещество  |  Тип  |Температура|  Скорость   |\n");
			printf("|           |       |  (град.С) |   (м/сек)   |\n");
			printf("|-----------|-------|-----------|-------------|\n");

			for (int i = 0; i < S; i++)
			{
				A[i].show();
			}
			printf("|---------------------------------------------|\n");
			printf("| примечание:  ч - чистое вещество, м - масло |\n");
			printf("-----------------------------------------------\n");

			cout << endl;

			cout << "Отсортированная структура:" << endl;
			//sort();


			printf("-----------------------------------------------\n");
			printf("|          Скорость звука в жидкостях         |\n");
			printf("|---------------------------------------------|\n");
			printf("| Вещество  |  Тип  |Температура|  Скорость   |\n");
			printf("|           |       |  (град.С) |   (м/сек)   |\n");
			printf("|-----------|-------|-----------|-------------|\n");

			for (int i = 0; i < S; i++)
			{
				A[i].show();
			}
			printf("|---------------------------------------------|\n");
			printf("| примечание:  ч - чистое вещество, м - масло |\n");
			printf("-----------------------------------------------\n");
		}

		else if (a == 4) {
			printf("-----------------------------------------------\n");
			printf("|          Скорость звука в жидкостях         |\n");
			printf("|---------------------------------------------|\n");
			printf("| Вещество  |  Тип  |Температура|  Скорость   |\n");
			printf("|           |       |  (град.С) |   (м/сек)   |\n");
			printf("|-----------|-------|-----------|-------------|\n");

			for (int i = 0; i < S; i++)
			{
				A[i].show();
			}
			printf("|---------------------------------------------|\n");
			printf("| примечание:  ч - чистое вещество, м - масло |\n");
			printf("-----------------------------------------------\n");
			system("PAUSE");
		}
		break;

	default:
		cout << "неверное число" << endl;
		break;
	}
	system("cls");
	
	return 0;

}